[
  {
    "id": "4958751c-68fd-4c11-a8e8-80fa7ec6088f",
    "text": "DNBLab: Zugang zu Datensets und digitalen Objekten\nDie Deutsche Nationalbibliothek bietet ihre bibliografischen Daten und mehrere digitale Objektsammlungen frei zugänglich an. Als zentraler Anlaufpunkt für die Präsentation, den Zugriff und die Nachnutzung der digitalen Ressourcen bietet das DNBLab einen Zugang zu unseren Daten, Objektdateien und Volltexten. Zugang erhalten Sie über verschiedene Schnittstellen und Downloads.\nEin weiteres Angebot: Jupyter Notebook Tutorial für Einsteiger*innen Wie können Daten mittels der SRU-Schnittstelle abgerufen werden?\nDas DNBLab kann von zu Hause aus sowie an unseren Internetrechnern in den Lesesälen ausprobiert werden.\nBei Interesse an automatisierten Analysen von geschützten Volltexten, Bildern oder AV-Medien bieten wir einmal jährlich die Möglichkeit einer Kooperation durch unseren DH-Call an.\nVeranstaltungen\nDNBLab: Freie digitale Objektsammlungen\nFoto: Thomas Meyer / OSTKREUZ\nEntdecken Sie unsere maschinenlesbar aufbereiteten Datensets und freie digitale Objektsammlungen.\nMehr\nDNBLab: Schnittstellen\nFoto: Thomas Meyer / OSTKREUZ\nErfahren Sie mehr über Abfragen unserer offenen Schnittstellen sowie darüber, wie Sie sich eigene Daten- und Objektsets zusammenstellen können.\nMehr\nDNBLab: Tutorials\nNeugierig? Werden Sie selbst aktiv! Mit Hilfe unserer einsteigerfreundlichen Tutorials zeigen wir Ihnen, wie Sie unseren Bestand abrufen und analysieren können.\nMehr\nDNBLab: Unsere Daten in der Praxis\nQuelle: BibSonomy Genealogie\nInformieren Sie sich, wie vielseitig unsere Daten in Wissenschaft und Forschung bereits analysiert und visualisiert wurden.\nMehr\nLetzte Änderung:\n04.03.2025\nKurz-URL:\nhttps://www.dnb.de/dnblab\nKontakt:\nlab@dnb.de",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLab/dnblab_node.html",
      "title": ""
    }
  },
  {
    "id": "e383b9f9-f485-465d-b508-cc10799a25fa",
    "text": "DNBLab: Unsere Daten in der Praxis\nQuelle: BibSonomy Genealogie\nSie möchten mehr über das Arbeiten mit unseren Daten und freien Objekten erfahren?\nWir haben einige Beispiele gesammelt, wie vielseitig unsere Daten in Wissenschaft und Forschung analysiert und visualisiert werden. Lassen Sie sich inspirieren und nutzen Sie Open Source Code in GitHub für Ihr eigenes Forschungsvorhaben.\nÜber Einblicke in Ihre Arbeit und Ihre Beteiligung am Ausbau unserer Praxisbeispiele freuen wir uns! Bei Fragen sind wir unter lab@dnb.de für Sie da.\nAnwendungen und Demos\nDNB Data Explorer\nDer Data Explorer visualisiert Zusammenhänge in Datensätzen der Deutschen Nationalbibliothek.\nDNBVIS\nIm Zentrum des Projektes DNBVIS stand die Frage, wie man virtuell durch eine Bibliothek flanieren und ihre Bestände explorativ erkunden kann. Im Rahmen der Forschungskooperation „Visualisierung bibliografischer Daten und Inhalte” zwischen der Deutschen Nationalbibliothek und der Fachhochschule Potsdam wurde diesen Fragen nachgegangen und 2017 dafür ein Prototyp entwickelt.\nPrototyp (funktioniert mit Chrome und Firefox); Github-Repository Skripte und Prototyp\nGND Dashboard\nDas GND Dashboard wurde anlässlich der GNDCon II erstellt und lädt zu einem interaktiven Erforschen der GND ein. Hier finden Sie statistische Auswertungen der GND und ihrer Verknüpfungen mit den Titeldaten der Deutschen Nationalbibliothek.\nBibSonomy\nDie BibSonomy Genealogie ist Teil der sozialen Verschlagwortungsplattform BibSonomy und verfolgt das Ziel, eine freie Genealogie der deutschen Wissenschaft zu erstellen. Promovierte können sich sowohl den Betreuer*innen ihrer Doktorarbeit zuordnen als auch weitere wissenschaftliche Beziehungen und Publikationsdaten gemeinsam verwalten und abbilden. Daraus kann insbesondere ein Stammbaum der Forschung an deutschen Universitäten erstellt werden. Grundlage der Daten ist der Katalog der Deutschen Nationalbibliothek.\nKinder- und Jugendliteratur-Bot\nDer Kinder- und Jugendliteratur-Bot (KJL-Bot) sammelt deutschsprachige Neuerscheinungen ausgewählter Verlage aus dem Bereich Kinder- und Jugendliteratur und führt sie strukturiert und durchsuchbar auf einer Website zusammen. Datenbasis bildet der Katalog der Deutschen Nationalbibliothek.\n“Mapping German Fiction in Translation” Webapplikation\nDie Webapplikation dient der exemplarischen Visualisierung der in der Deutschen Nationalbibliothek katalogisierten Übersetzungen deutschsprachiger Autor*innen. Neben Informationen wie die Anzahl der Titel und Zielsprachen, kann man durch einen Mausklick auf der Karte für jede Übersetzung die Sprache, den Verlag und den Titel anzeigen.\nWebapplikation Dataverse Poster\nDNBVIS_frodiss\nDie Anwendung DNBVIS_frodiss ist eine exemplarische Entwicklung der Deutschen Nationalbibliothek, die unser Datenset der „Freien Online-Hochschulschriften“ visualisiert. Sie gibt damit Einblicke in unseren Bestand von derzeit über 302.000 freien Online-Dissertationen und präsentiert ihn mehrschichtig in interaktiven Grafiken nach Erscheinungsjahren, Fachgebieten, Sachgruppen, Publikationsorten, Hochschulen und Sprachen.\nExilmonografien-App\nDer Prototyp dient der Visualisierung von häufig gestellten Forschungsfragen an die Sammlung der Exilmonografien des Deutschen Exilarchivs 1933-1945. Er entstand im Rahmen eines DNB-internen Hackathons und gibt erste Antworten auf Fragen wie: Wo sind Exilmonografien entstanden? Wie verteilen sich Exilmonografien auf die Erscheinungsländer und Erscheinungsorte? Wo und wann sind die meisten Exilmonografien entstanden? Was sind die entlegensten Erscheinungsorte?",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLabPraxis/dnblabPraxis_node.html",
      "title": ""
    }
  },
  {
    "id": "5be692a1-53f6-44b7-9b09-6cf389a99685",
    "text": "Exilmonografien-App\nDer Prototyp dient der Visualisierung von häufig gestellten Forschungsfragen an die Sammlung der Exilmonografien des Deutschen Exilarchivs 1933-1945. Er entstand im Rahmen eines DNB-internen Hackathons und gibt erste Antworten auf Fragen wie: Wo sind Exilmonografien entstanden? Wie verteilen sich Exilmonografien auf die Erscheinungsländer und Erscheinungsorte? Wo und wann sind die meisten Exilmonografien entstanden? Was sind die entlegensten Erscheinungsorte?\nCode-Beispiele und Jupyter Notebooks\nAmerican Guild - Network Data\nDas im Rahmen des Hackathons Coding Da Vinci 2020 entwickelte Projekt hatte zum Ziel, die Netzwerke im Exil anhand der Kommunikationswege einer Exil- und Hilfsorganisation zu visualisieren. Das Archiv der Deutschen Akademie im Exil/ American Guild for German Cultural Freedom umfasst 968 Personenmappen. Fragebögen, Lebensläufe und Korrespondenzen aus vielen Orten der Welt sind überliefert. Mit Stipendiat*innen wie Bertolt Brecht, Alfred Döblin, John Heartfield, Egon Erwin Kisch, Joseph Roth, Anna Seghers und Arnold Zweig ist das Archiv ein „Who is Who“ der deutschsprachigen Emigration.\nDatenbasis bildet ein speziell für den Hackathon bereitgestelltes Datenset \"American Guild for German Cultural Freedom\" des Deutschen Exilarchivs 1933–1945.\nÄpfel und Birnen\nDass sich Kulturdaten nicht nur zur Datenanalyse eignen, zeigt das im Rahmen des Kulturhackathon Coding Da Vinci entwickelte Projekt: Äpfel und Birnen. In der Mini-GameCompilation, für die die im DNBLab enthaltenen Buchhändlerportraits genutzt wurden, können Spieler*innen in das Leben von Obst eintauchen.\nDatenlabor\nDigital Humanities gewinnen im Bereich der Geistes- und Kulturwissenschaften immer mehr an Bedeutung. Lernen Sie die Grundlagen von Python kennen und erhalten Sie einen Einblick, wie Kulturdaten analysiert werden können.\nEinstieg in GitHub, Datenanalyse in GitHub\nDie Gemeinsame Normdatei entdecken\nHier finden Sie Dokumentationen bibliografischer Regeln (RDA und GND) und Werkzeuge zum Experimentieren mit den Daten der GND.\nLiebe und Tod in der Deutschen Nationalbibliothek\nDer Katalog der Deutschen Nationalbibliothek wird zum Forschungsobjekt. In dieser Untersuchung wurde ein Framework entwickelt, um bestimmte Aspekte des Katalogs anhand der Beispiele von Romanen zu untersuchen.\nLiebe und Tod in der Nationalbibliothek, GitHub\nAuf R basierte Schnittstellenabfrage der DNB-Daten\nBeispiel einer automatisierten Abfrage der SRU Schnittstelle der Deutschen Nationalbibliothek mittels Programmiersprache R.\nLetzte Änderung:\n02.05.2024\nKurz-URL:\nhttps://www.dnb.de/dnblabpraxis\nKontakt:\nlab@dnb.de",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLabPraxis/dnblabPraxis_node.html",
      "title": ""
    }
  },
  {
    "id": "2f15e7b4-ed6d-4782-a940-be09b06992fb",
    "text": "DnbLab: Schnittstellen\nFoto: Thomas Meyer / OSTKREUZ\nUnsere Daten und freien digitalen Objekte können über drei verschiedene Schnittstellen abgefragt werden.\nOAI-Schnittstellen\nÜber OAI-PMH (Open Archives Initiative Protocol for Metadata Harvesting) bieten wir zwei verschiedene Schnittstellen an.\nInformationen zu der im Rahmen der Metadatendienste angebotenen OAI-Schnittstelle zur Abfrage von Metadaten und darüber verfügbaren Sets (Deutsche Nationalbibliografie, Normdaten und Zeitschriftendatenbank) finden Sie unter https://www.dnb.de/oai.\nBeispielanfrage zur Ermittlung aller online frei verfügbaren Dissertationen der Sachgruppe „Sozialwissenschaften, Soziologie, Anthropologie“ aus einem bestimmten Zeitraum:\nUnsere OAI2-Schnittstelle ermöglicht die Abfrage von Metadaten und Links auf Bilddateien gemeinfreier Digitalisate.\nBeispielanfrage zur Ermittlung aller frei verfügbaren digitalisierten Buchhändlerportraits seit einem bestimmten Datum:\nSehen Sie auch: Jupyter Notebook Tutorial Wie können Daten mittels der OAI-Schnittstellen abgerufen werden?\nSRU-Schnittstelle\nÜber SRU (Search/Retrieve via URL) können Sie in den Daten der Deutschen Nationalbibliothek in Form von URLs oder über ein Computerprogramm (z.B. Python Bibliothek) suchen und eigene Datensets zusammenstellen. Anfragen werden wie im Katalog in der Retrievalsprache Contextual Query Language (CQL) formuliert und als Parameter an die URL angehängt.\nBeispielanfrage zur Ermittlung aller online frei verfügbaren Titel mit dem Stichwort Klimawandel (tit=klimawandel and location=onlinefree):\nhttps://services.dnb.de/sru/dnb?version=1.1&operation=searchRetrieve&query=tit3Dklimawandel*+and\n+location%3Donlinefree&recordSchema=MARC21-xml\nDie Ergebnisse können per XML in verschiedenen bibliografischen Formaten ausgeliefert werden. Weiterführende Informationen zu den SRU-Funktionen, Suchattributen, verfügbaren Katalogen und Formaten finden Sie unter www.dnb.de/sru.\nSehen Sie auch: Jupyter Notebook Tutorial Wie können Daten mittels der SRU-Schnittstelle abgerufen werden?\nNutzungs- und Bezugsbedingungen\nDie Metadaten und Online-Schnittstellen werden ohne Gewähr dafür angeboten, dass sie ununterbrochen, pünktlich, fehlerfrei, vollständig sind und dass sie nicht Rechte Dritter (zum Beispiel Persönlichkeits- oder Urheberrechte) verletzen.\nLetzte Änderung:\n16.02.2022\nKurz-URL:\nhttps://www.dnb.de/dnblabapi\nKontakt:\nlab@dnb.de",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLab/dnblabSchnittstellen.html",
      "title": ""
    }
  },
  {
    "id": "77572dcf-ac8f-4f60-a06b-ebf5fa58544a",
    "text": "Der Museumslesesaal in Leipzig öffnet am Montag, 12.05.2025 wegen Wartungsarbeiten erst um 16 Uhr.\nLeipzig: Donnerstag 15.05.2025\nDie Deutsche Nationalbibliothek in Leipzig öffnet am Donnerstag, 15.05.2025 wegen Wartungsarbeiten erst um 16 Uhr.\nDer Museumslesesaal und die Ausstellungen des Deutschen Buch- und Schriftmuseums sind geöffnet.\nZum Einstieg können Sie sich unsere Erklärvideos zum Arbeiten mit dem DNBLab anschauen. Wir stellen Ihnen das DNBLab vor und zeigen Ihnen, wie Sie unsere Daten und freien Objekte mittels Schnittstellen abrufen und anschließend analysieren können.\nFür das Arbeiten und die Analyse unserer Daten und frei verfügbaren Objekten stellen wir im DNBLab Online Coding Tutorials (Jupyter Notebooks) zur Verfügung.\nWie können Jupyter Notebooks im Browser aufgerufen und ausgeführt werden?\nWie können Daten mittels der OAI-Schnittstelle abgerufen werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nWie können Daten mittels der SRU-Schnittstelle abgerufen werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nWie können digitalisierte Inhaltsverzeichnisse abgerufen und analysiert werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nVolltextanalyse digitalisierter Inhaltsverzeichnisse\nStatische Version : Anzeige im Browser\nWie können Daten aufbereitet und visualisiert werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nWie können Audio-Dateien abgerufen und analysiert werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nAufruf und Analyse von Audio-Dateien\nStatische Version : Anzeige im Browser\nWie können Daten mittels Open Refine aufbereitet und angereichert werden?\nBitte verwenden Sie die statische Version zum Lesen der Tutorials. Um den Code in den Tutorials aktiv ausführen und bei Bedarf anpassen zu können, nutzen Sie bitte die interaktive Version.\nCookies erleichtern die Bereitstellung unserer Dienste. Mit der Nutzung unserer Dienste erklären Sie sich damit einverstanden, dass wir Cookies verwenden. Weitere Informationen zum Datenschutz erhalten Sie über den folgenden Link: Datenschutz",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLab/dnblabTutorials.html?nn=849628",
      "title": ""
    }
  },
  {
    "id": "368a820b-57a9-4423-b7b9-ebc043ed6fdd",
    "text": "DnbLab: Schnittstellen\nFoto: Thomas Meyer / OSTKREUZ\nUnsere Daten und freien digitalen Objekte können über drei verschiedene Schnittstellen abgefragt werden.\nOAI-Schnittstellen\nÜber OAI-PMH (Open Archives Initiative Protocol for Metadata Harvesting) bieten wir zwei verschiedene Schnittstellen an.\nInformationen zu der im Rahmen der Metadatendienste angebotenen OAI-Schnittstelle zur Abfrage von Metadaten und darüber verfügbaren Sets (Deutsche Nationalbibliografie, Normdaten und Zeitschriftendatenbank) finden Sie unter https://www.dnb.de/oai.\nBeispielanfrage zur Ermittlung aller online frei verfügbaren Dissertationen der Sachgruppe „Sozialwissenschaften, Soziologie, Anthropologie“ aus einem bestimmten Zeitraum:\nUnsere OAI2-Schnittstelle ermöglicht die Abfrage von Metadaten und Links auf Bilddateien gemeinfreier Digitalisate.\nBeispielanfrage zur Ermittlung aller frei verfügbaren digitalisierten Buchhändlerportraits seit einem bestimmten Datum:\nSehen Sie auch: Jupyter Notebook Tutorial Wie können Daten mittels der OAI-Schnittstellen abgerufen werden?\nSRU-Schnittstelle\nÜber SRU (Search/Retrieve via URL) können Sie in den Daten der Deutschen Nationalbibliothek in Form von URLs oder über ein Computerprogramm (z.B. Python Bibliothek) suchen und eigene Datensets zusammenstellen. Anfragen werden wie im Katalog in der Retrievalsprache Contextual Query Language (CQL) formuliert und als Parameter an die URL angehängt.\nBeispielanfrage zur Ermittlung aller online frei verfügbaren Titel mit dem Stichwort Klimawandel (tit=klimawandel and location=onlinefree):\nhttps://services.dnb.de/sru/dnb?version=1.1&operation=searchRetrieve&query=tit3Dklimawandel*+and\n+location%3Donlinefree&recordSchema=MARC21-xml\nDie Ergebnisse können per XML in verschiedenen bibliografischen Formaten ausgeliefert werden. Weiterführende Informationen zu den SRU-Funktionen, Suchattributen, verfügbaren Katalogen und Formaten finden Sie unter www.dnb.de/sru.\nSehen Sie auch: Jupyter Notebook Tutorial Wie können Daten mittels der SRU-Schnittstelle abgerufen werden?\nNutzungs- und Bezugsbedingungen\nDie Metadaten und Online-Schnittstellen werden ohne Gewähr dafür angeboten, dass sie ununterbrochen, pünktlich, fehlerfrei, vollständig sind und dass sie nicht Rechte Dritter (zum Beispiel Persönlichkeits- oder Urheberrechte) verletzen.\nLetzte Änderung:\n16.02.2022\nKurz-URL:\nhttps://www.dnb.de/dnblabapi\nKontakt:\nlab@dnb.de",
    "metadata": {
      "source": "https://www.dnb.de/DE/Professionell/Services/WissenschaftundForschung/DNBLab/dnblabSchnittstellen.html?nn=849628",
      "title": ""
    }
  }
]